import { ScrollView, Text, View } from 'react-native'
import { colors } from '../../colors'
import styled from 'styled-components/native'
import { ScreenLayout } from '../../components/Shared'

export default function ServiceTerms() {
  return (
    <ScreenLayout>
      <ScrollView showsVerticalScrollIndicator={false}>
        <Container>
          <TitleText style={{ color: colors.primary_outline, marginTop: 0 }}>제 1장 총 칙</TitleText>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 1조 (목적)</TitleText>
          <Contents>
            본 약관은 (주)Petmory(이하 “회사”라 합니다)가 제공하는 공유TODO관리 서비스 ‘Pawith(포잇)’을 이용함에 있어
            회원과 회사 간의 권리, 의무 및 책임사항, 이용조건 및 절차 등 기본적인 사항을 규정함을 목적으로 합니다.
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 2조 (용어의 정의)</TitleText>
          <Contents>
            {`본 약관에서 사용되는 용어의 정의는 다음과 같습니다. Pawith(포잇) : 회사가 운영하는 플랫폼을 의미하며, 인터넷, 모바일 어플리케이션(이하 ‘앱’) 등을 통하여 콘텐츠와 광고를 이용자에게 제공하거나, 나아가 회사 또는 이용자가 창작한 다양한 콘텐츠를 게시하고 그를 통하여 이용자 간 커뮤니케이션이 진행될 수 있도록 설정한 공간을 말하며, 재화 또는 용역(이하 “재화 등”이라 합니다)을 이용자에게 제공하기 위하여 설정한 가상의 영업장 입니다.
① 사이트 : 재화 등을 이용자에게 제공하기 위하여 컴퓨터나 핸드폰 등 정보통신설비를 이용하여 재하 등을 거래할 수 있도록 설정한 가상의 영업장을 말합니다.
② 서비스 : 회사가 회원에게 제공하는 TODO 및 일정 작성과 공유가 가능한 모바일앱 서비스 및 이에 부수하는 제반 서비스로, Pawith(포잇)과 관련된 서비스 일체를 의미합니다.
③ 이용자 : 본 약관에따라 회사에서 제공하는 서비스를 받는 자를 지칭합니다.
④ 회원 : 서비스를 이용하기 위하여 이용약관에 동의하고,회사의 회원으로 가입한 자를 지칭합니다.
⑤ 탈퇴 : 회원이 이용계약을 종료시키는 행위를 의미합니다.
⑥ 프로필 이름: 회원의 식별과 서비스 이용을 위하여 회원가입 시 회원이 정하고 회사가 승인하는 문자의 조합을 의미합니다.
⑦TODO : 회원이 서비스 이용의 일환으로 생성하는 게시글 및 그에 포함된부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ영상ㆍ도형ㆍ색채ㆍ이미지 등(이들의 복합체도 포함)을 의미합니다.
⑧ Pamily(패밀리): 1명 이상의 회원이 TODO 공유를 위해 모인 가상의 모임 공간을 의미합니다.
⑨ 회원콘텐츠 : 회원이 서비스 내에게시한 일정 등 게시글, 프로필이름, 패밀리 이름, 패밀리 대표 이미지, 펫 이름, 품종, 대표 이미지 등 회원이서비스 내 게시한 글, 이미지를 말합니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 3조 (약관의 효력 및 변경)</TitleText>
          <Contents>
            {`① 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을 발생합니다.
② 회사가 본 약관의 내용을 앱 화면 또는 연결화면에 게재하여 이용자에게 통지하고, 그 내용에 동의한 이용자가 본 서비스에 가입하여 회원이 되었을 때 이 약관의 효력이 발생합니다.
③ 회사는 『약관의 규제에 관한 법률』, 『전자상거래 등에서의 소비자보호에 관한 법률』, 『정보통신망 이용촉진 및 정보보호(이하 “정보통신망법”이라 합니다)』, , 『소비자기본법』, 『전자문서 및 전자거래 기본법』등 관련법에 위배되지 않는 범위 내에서 본 약관을 개정할 수 있습니다.
④ 회사가 약관을 변경할 경우에는 적용일자, 변경사유를 명시하여 적용일로부터 7일 이전부터 공지합니다. 다만, 회원에게 불리한 약관 변경인 경우에는 그 적용일로부터 30일전부터 위와 같은 방법으로 공지하고, E-mail 등으로 회원에게 개별 통지합니다. 단, 회원의 연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우 공지를 개별 통지로 간주합니다.
⑤ 회사가 제4항에 따라 개정약관을 공지 또는 통지하면서, 회원에게 약관 변경 적용일 까지 거부의사를 표시하지 않으면 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 명시적으로 약관변경에 대한 거부의사를 표시하지 아니하는 경우 회원이 개정약관에 동의한 것으로 간주합니다.
⑥ 회원은 변경된 약관에 동의하지 아니하는 경우 서비스의 이용을 중단하고 이용계약을 해지할 수 있습니다.
⑦ 회원은 약관 변경에 대하여 주의 의무를 다하여야 하며, 변경된 약관의 부지로 인한 회원의 피해는 회사가 책임지지 않습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>
            제 4조 (약관 외 준칙 및 관련법령과의 관계)
          </TitleText>
          <Contents>
            {`① 본 약관 또는 개별약관에서 정하지 않은 사항은 『전기통신사업법』, 『전자문서 및 전자거래 기본법』, 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』, 『전자상거래 등에서의 소비자보호에 관한 법률』, 『개인정보보호법』 등 관련 법의 규정 및 회사가 정한 서비스의 세부이용지침 등의 규정에 따릅니다. 또한 본 약관에서 정한 회사의 책임 제한 규정은 관련 법령이 허용하는 최대한도의 범위 내에서 적용됩니다.
② 회사는 필요한 경우 서비스 내의 개별항목에 대하여 개별약관 또는 운영원칙을 정할 수 있으며, 본 약관과 개별약관 또는 운영원칙의 내용이 상충되는 경우에는 개별약관 또는 운영원칙의 내용이 우선 적용됩니다.
③ 본 약관 또는 개별약관에서 정하지 않은 사항과 본 약관의 해석에 관하여는 관계 법령 또는 일반적인 상관례에 따릅니다.`}
          </Contents>
          <TitleText style={{ color: colors.primary_outline, marginTop: 16 }}>제 2장 이용계약의 체결</TitleText>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 5조 (이용계약의 성립)</TitleText>
          <Contents>
            {`① 이용계약은 회원이 되고자 하는 자(이하 “가입신청자”)가 약관의 내용에 동의를 하고, 회사가 정한 가입 양식에 따라 회원정보를 기입하여 회원가입신청을 하고 회사가 이러한 신청에 대하여 승인함으로써 체결됩니다.
② 회사는 이용약관에 동의한 후 이용신청한 사용자에 대해서 원칙적으로 서비스 이용을 승낙함을 원칙으로 합니다. 다만 회사는 제 6조에서 정하는 사항에 대한 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
③ 가입신청자가 입력한 정보는 사실로 간주됩니다. 회사는 정보의 사실 여부가 의심되는 경우 이를 확인하기 위해 가입신청자에게 증빙자료의 제출을 요구할 수 있습니다. 회원이 입력한 정보가 거짓임이 확인되는 경우 회사는 해당 가입신청자의 서비스 이용을 전면 거부할 수 있고, 이로 인해 발생하는 모든 불이익에 대하여 회사는 책임지지 않습니다.
④ 회사는 회원의 서비스 이용 기간, 횟수 등 이용 내용에 따라 합리적인 기준을 통해 서비스 제공 범위에 차등을 둘 수 있고, 이에 따라 회원은 일부 서비스의 이용에 제약을 받을 수 있습니다.
⑤ 회사는 가입신청자의 닉네임이 개인정보 유출 또는 회사 및 회사의 운영자로 오인될 우려가 있거나 미풍양속에 어긋나거나 반사회적인 경우 등에 대하여 닉네임의 사용을 제한하거나 닉네임의 수정 또는 삭제할 수 있습니다.
⑥ 회원의 정보 변경 및 자격은 회사가 제공하는 모든 사이트에 동일하게 적용됩니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 6조 (이용게약의 유보 및 거절)</TitleText>
          <Contents>
            {`① 회사는 다음 각 호에 해당하는 신청에 대하여는 승인 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
  (1) 가입신청서의 내용을 허위로 기재하거나 기재누락 및 오기가 있는 경우
  (2) 다른 사람의 명의, E-mail, 연락처 등을 이용한 경우
  (3) 관계법령에 위배되거나 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우
  (4) 가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우(단, 회사의 사전 재가입 승낙을 얻은 경우에는 예외로 함)
  (5) 회원의 귀책사유로 인하여 승인이 불가능한 경우
  (6) 이미 가입된 회원과 전화번호나 E-mail 정보가 동일한 경우
  (7) 부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우
  (8) 기타 본 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우 및 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우
② 제1항에 따른 신청에 있어 회사는 전문기관을 통한 휴대전화번호 인증 내지 실명확인을 통한 본인인증을 요청할 수 있습니다.
③ 회사는 아래 각 호에 해당하는 경우에는 회원등록의 승낙을 유보할 수 있습니다.
  (1) 제공서비스 설비용량에 현실적인 여유가 없는 경우
  (2) 서비스를 제공하기에는 기술적으로 문제가 있다고 판단되는 경우
  (3) 회사가 재정적, 기술적으로 필요하다고 인정하는 경우
  (4) 제2항에 따른 실명확인 및 본인인증 절차를 진행 중인 경우
④ 제1항과 제3항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, 회사는 승낙거절 또는 유보 사실을 가입신청자에게 회사가 정하는 방법에 따라 통지합니다.
⑤ 이용계약의 성립 시기는 회사가 ‘가입완료’ 사실을 신청절차 상에 표시하거나 별도로 통지한 시점으로 합니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 7조 (이용계약사항의 변경)</TitleText>
          <Contents>
            회원은 이용계약 시 기재한 사항이 변경되었을 경우에는 그 정보를 수정 및 갱신하여야 하며 미변경으로 인하여
            발생하는 문제의 책임은 회원 본인에게 있습니다.
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 8조 (이용계약의 해지)</TitleText>
          <Contents>
            회원이 서비스 이용계약을 해지하고자 할 경우에는 온라인 또는 회사에서 정한 방법을 통하여 이요예약의 해지를
            신청해야 합니다.
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>
            제 9조 (회원정보 사용에 대한 동의)
          </TitleText>
          <Contents>
            {`① 회원의 개인정보는 개인정보보호법에 의해 보호됩니다.
② 회원의 개인정보는 본 이용계약의 이행과 본 이용계약상의 서비스 제공을 위한 목적으로만 이용됩니다.
③ 이용자가 본 약관에 동의하는 것은 회사가 회원가입신청양식에 기재된 회원정보를 수집ㆍ이용하는 것에 동의하는 것으로 간주됩니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 10조 (계정정보의 관리책임)</TitleText>
          <Contents>
            {`① 회사 회원가입절차를 완료하는 순간부터 회원의 개인정보의 비밀을 유지할 책임은 전적으로 회원 본인에게 있으며, 회원은 계정정보를 타인에게 양도 내지 대여할 수 없습니다.
② 회사는 회사의 귀책사유로 인한 경우를 제외하고 계정정보의 유출, 양도, 대여, 공유 등으로 인한 손실이나 손해에 대하여 아무런 책임을 지지 않습니다.
③ 회원은 제3자가 본인의 계정을 사용하고 있음(대여 포함)을 인지한 경우에는 즉시 조치를 취하고 이를 회사에 통보하여야 합니다. 회원이 본 항에 따른 통지를 하지 아니하여 발생하는 모든 불이익에 대한 책임은 회원에게 있습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 11조 (회원정보의 수집과 보호)</TitleText>
          <Contents>
            {`① 회사는 서비스를 제공함에 있어 개인정보 관련 법령을 준수하고 그에 따라 회원 정보를 수집, 이용, 보관 및 제공합니다.
② 회사는 회원이 서비스 이용 과정에서 직접 제공한 정보 외에도 개인정보 보호 등 관련 법령에서 정한 절차에 따라 그 밖의 정보를 수집 및 이용 또는 제3자에게 제공할 수 있습니다. 이 경우 회사는 관련 법령에 따라 회원으로부터 필요한 동의를 받거나 관련 법령에서 정한 절차를 준수합니다.
③ 회사는 개인정보 보호 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력하며, 회사의 개인정보 처리에 관한 자세한 사항은 개인정보처리방침을 통해 언제든지 확인할 수 있습니다.
④ 회사의 공식 사이트 이외에 링크된 사이트에서는 회사의 개인정보처리방침이 적용되지 않습니다. 링크된 사이트 및 서비스를 제공하는 제3자의 개인정보 처리에 대해서는 해당 사이트 및 제3자의 개인정보처리방침을 확인할 책임이 회원에게 있으며, 회사는 이에 대하여 책임을 부담하지 않습니다.`}
          </Contents>
          <TitleText style={{ color: colors.primary_outline, marginTop: 16 }}>제 3장 서비스 이용</TitleText>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 12조 (서비스의 이용 개시)</TitleText>
          <Contents>
            {`회원은 회사가 이용신청을 승낙한 때부터 서비스를 사용할 수 있고 회사는 위 승낙한 때부터 본약관에 따라 서비스를 제공합니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 13조 (서비스의 이용시간)</TitleText>
          <Contents>
            {`① 서비스는 회사의 업무상 또는 기술상 특별한 사유가 없는 한 연중무휴 1일 24시간 제공함을 원칙으로 합니다. 다만, 회사는 서비스의 제공에 필요한 경우 정기점검 내지 수시점검을 실시할 수 있으며, 정기점검 내지 수시점검 시간은 서비스 제공화면에 공지한 바에 따릅니다.
② 회사는 서비스별로 이용할 수 있는 시간을 별도로 정할 수 있으며, 필요한 경우에는 이를 조정할 수 있습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 14조 (서비스의 내용)</TitleText>
          <Contents>
            {`① 서비스는 제2조 ②항에서 정의한 바에 따라 회사가 회원에게 제공하는 온라인 서비스를 말합니다. 서비스는 현재 제공되는 서비스 등에 한정되지 않으며, 향후 추가로 개발되거나 다른 회사와의 제휴 등을 통해 추가, 변경, 수정될 수 있고, 이 과정에서 일부 서비스의 경우 본인 인증 절차를 요구할 수 있습니다.
② 회사는 회원 감소 등으로 인한 원활한 서비스 제공의 곤란 및 수익성 악화, 기술 진보에 따른 차세대 서비스로의 전환 필요성, 서비스 제공과 관련한 회사 정책의 변경 등 기타 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경 또는 중단할 수 있습니다.
③ 서비스의 내용, 이용방법, 이용시간에 대하여 변경 또는 서비스 중단이 있는 경우에는 변경 또는 중단될 서비스의 내용 및 사유와 일자 등은 그 변경 또는 중단 전에 회사 홈페이지 또는 서비스 내 "공지사항" 화면 등 회원이 충분히 인지할 수 있는 방법으로 30일의 기간을 두고 사전에 공지합니다.
④ 본조에 따른 서비스의 전부 또는 일부 종료 시 관련법령에서 특별히 정하지 않는 한 회원에게 별도의 보상을 하지 않습니다.
⑤ 회원은 서비스의 내용을 충분히 숙지하고 서비스를 이용하여야 합니다. 회사는 통신판매의 당사자가 아니고, 회원은 이용시 반드시 그 내용을 확인해야 합니다. 회원이 이 내용을 제대로 숙지하지 못해 발생한 피해에 대해서는 회사가 책임을 부담하지 않습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 15조 (서비스의 변경 및 중지)</TitleText>
          <Contents>
            {`① 회사는 변경될 서비스의 내용 및 제공일자를 본 약관 제21조에서 정한 방법으로 회원에게 고지하고 서비스를 변경하여 제공할 수 있습니다.
② 회사는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
  (1) 일부 서비스를 이용함에 있어 요구되는 본인인증 절차를 거치지 않거나, 본인인증 정보가 위조·변조·허위의 정보임이 확인된 경우
  (2) 회원이 회사의 영업활동을 방해하는 경우
  (3) 시스템 정기점검, 서버의 증설 및 교체, 네트워크의 불안정 등의 시스템 운영상 필요한 경우
  (4) 정전, 서비스 설비의 장애, 서비스 이용폭주, 기간통신사업자의 설비 보수 또는 점검, 중지 등으로 인하여 정상적인 서비스 제공이 불가능한 경우
  (5) 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우
  (6) 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
③ 제②항에 의한 서비스 중단의 경우 회사는 제21조에서 정한 방법으로 회원에게 통지합니다. 다만, 회사가 통제할 수 없는 사유로 인한 서비스의 중단(운영자의 고의, 과실이 없는 장애, 시스템다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.
④ 회사는 제②항에 따른 서비스의 변경, 중지로 발생하는 문제에 대해서 어떠한 책임도 지지 않습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>
            제 16조 (정보 제공 및 광고의 개재)
          </TitleText>
          <Contents>
            {`① 회사가 회원에게 서비스를 제공할 수 있는 서비스 투자기반의 일부는 광고 게재를 통한 수익으로부터 나옵니다. 이에 영리목적 광고성 정보 수신동의한 회원(기존, 본 약관 동의로 영리목적 광고성 정보 수신 동의로 처리된 회원 포함, 이하 “동의 회원”)에게 서비스 이용 시 서비스 화면 상 광고가 노출됩니다.
② 회사는 회원의 게시물 내용, 검색 내용 뿐만 아니라 언어, 쿠키 및 기기정보, IP 주소, 브라우저 유형, 운영체제 및 요청 일시와 같은 표준 로그 정보 등을 활용한 맞춤광고를 제공합니다. 이에 대한 자세한 사항은 "개인정보처리방침"을 참고하시기 바랍니다.
③ 회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한 광고주의 판촉활동에 다른 상품등을 이용하는 경우, 이는 전적으로 회원과 광고주 간의 법률관계이므로, 그로 인해 발생한 회원과 광고주간 분쟁 등 제반 문제는 회원과 광고주간에 직접 해결하여야 하며, 이와 관련하여 회사는 어떠한 책임도 지지 않습니다.
④ 회사는 동의 회원으로부터 수집한 개인정보를 통해 회원의 서비스 이용 중 필요하다고 판단되는 다양한 마케팅 정보를 SMS(LMS), E-mail 등을 활용하여 발송할 수 있습니다. 다만, 회원은 거래관련정보 및 고객문의 등에 대한 답변을 제외하고 관련법에 따라 언제든지 마케팅 수신 동의를 철회하실 수 있으며, 이 경우 회사는 전단의 마케팅 정보 등을 제공하는 행위를 중단합니다(단, 시스템 반영에 시차가 있을 수 있음).`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 17조(게시물에 대한 권리)</TitleText>
          <Contents>
            {`① 게시물의 저작권은 회원에게 있습니다. 다만 회사는 게시, 전달, 공유 목적으로 회원이 작성한 게시물을 이용, 편집, 수정하여 이용할 수 있고, 회사의 다른 서비스 또는 연동 채널, 판매 채널에 이를 게재하거나 활용할 수 있습니다.
② 회사가 서비스 내 게재 이외의 목적으로 게시물을 사용할 경우 게시물에 대한 게시자를 반드시 명시해야 합니다. 단, 게시자를 알 수 없는 익명 게시물이나 비영리적인 경우에는 그러하지 아니합니다.
③ 회원은 게시물을 작성할 때 타인의 저작권 등 지식재산권을 포함하여 여타 권리를 침해하지 않아야 하고, 회사는 그에 대한 어떠한 책임도 부담하지 않습니다. 만일 회원이 타인의 권리 등을 침해하였음을 이유로 타인이 회사를 상대로 이의신청, 손해배상청구, 삭제요청 등을 제기한 경우 회사는 그에 필요한 조치를 취할 수 있으며, 그에 따른 모든 비용이나 손해배상책임은 회원이 부담합니다.
④ 회사는 회원이 이용계약을 해지하고 사이트를 탈퇴하거나 적법한 사유로 해지된 경우 해당 회원이 게시하였던 게시물을 삭제할 수 있습니다.
⑤ 회원이 작성한 게시물에 대한 모든 권리 및 책임은 이를 게시한 회원에게 있으며, 회사는 회원이 게시하거나 등록한 게시물이 다음 각 호에 해당한다고 판단되는 경우에 사전통지 없이 삭제 또는 임시조치할 수 있고, 이에 대하여 회사는 어떠한 책임도 지지 않습니다.
  (1) 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우
  (2) 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우
  (3) 불법복제 또는 해킹을 조장하는 내용인 경우
  (4) 회사로부터 사전 승인 받지 않고 상업광고, 판촉 내용을 게시하는 경우
  (5) 개인 간 금전거래를 요하는 경우
  (6) 범죄적 행위에 결부된다고 인정되는 경우
  (7) 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
  (8) 타인의 계정정보, 성명 등을 무단으로 도용하여 작성한 내용이거나, 타인이 입력한 정보를 무단으로 위변조한 내용인 경우
  (9) 사적인 정치적 판단이나 종교적 견해의 내용으로 회사가 서비스 성격에 부합하지 않는다고 판단하는 경우
  (10) 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우
  (11) 회사에서 규정한 게시물 원칙에 어긋나거나, 게시물을 작성하는 위치에 부여된 성격에 부합하지 않는 경우
  (12) 사업주 변경 또는 권리자(사업주)의 게시물 중단 또는 삭제 요청이 있는 경우
  (13) 기타 관계법령에 위배된다고 판단되는 경우
⑥ 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를 취하여야 합니다.
⑦ 회사는 본조 제②항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 "게시물"에 대해 임시조치 등을 취할 수 있습니다.
⑧ 본 조에 따른 세부절차는 정보통신망법 및 저작권법이 규정한 범위 내에서 회사가 정한 게시 중단 요청 서비스에 따릅니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 18조 (권리의 귀속)</TitleText>
          <Contents>
            {`① 서비스에 대한 저작권 및 지식재산권은 회사에 귀속됩니다. 단, 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
② 회사가 제공하는 서비스의 디자인, 회사가 만든 텍스트, 스크립트(script), 그래픽, 회원 상호간 전송 기능 등 회사가 제공하는 서비스에 관련된 모든 상표, 서비스 마크, 로고 등에 관한 저작권 기타 지적재산권은 대한민국 및 외국의 법령에 기하여 회사가 보유하고 있거나 회사에게 소유권 또는 사용권이 있습니다.
③ 회원은 본 이용약관으로 인하여 서비스를 소유하거나 서비스에 관한 저작권을 보유하게 되는 것이 아니라, 회사로부터 서비스의 이용을 허락 받게 되는바, 서비스는 정보취득 또는 개인용도로만 제공되는 형태로 회원이 이용할 수 있습니다.
④ 회원은 명시적으로 허락된 내용을 제외하고는 서비스를 통해 얻어지는 회원 상태정보를 영리 목적으로 사용, 복사, 유통하는 것을 포함하여 회사가 만든 텍스트, 스크립트, 그래픽의 회원 상호간 전송기능 등을 복사하거나 유통할 수 없습니다.
⑤ 회사는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라 계정, ID, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, 회원은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.
⑥ 회원은 서비스를 이용하는 과정에서 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송, 편집, 재가공 등 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.`}
          </Contents>
          <TitleText style={{ color: colors.primary_outline, marginTop: 16 }}>제 4장 계약당사자의 의무</TitleText>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 19조(회사의 의무)</TitleText>
          <Contents>
            {`① 회사는 관련법과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수하며, 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위하여 노력합니다.
③ 회사는 서비스이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 그에 필요한 조치를 취하여야 합니다.
④ 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한 손해가 회사의 고의나 과실에 의해 발생한 경우에 한하여 회사에서 책임을 부담하며, 그 책임의 범위는 통상손해에 한합니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 20조 (회원의 의무)</TitleText>
          <Contents>
            {`① 회원은 기타 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니 됩니다.
② 회원은 서비스의 이용권한, 기타 서비스 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며 이를 담보로 제공할 수 없습니다.
③ 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안됩니다.
  (1) 서비스 신청 변경, 본인인증 등 서비스 이용과정에서 허위내용을 기재·등록·전송 등을 하는 행위
  (2) 다른 회원의 개인정보를 도용하여 부당하게 서비스를 이용하거나, 정보를 도용하는 행위
  (3) 정당한 사유 없이 당사의 영업을 방해하는 내용을 기재하는 행위
  (4) 회사가 게시한 정보를 변경하는 행위
  (5) 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등을 송신 또는 게시하는 행위
  (6) 회사와 기타 제3자의 저작권 등 지적재산권을 침해하는 행위
  (7) 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
  (8) 외설 또는 폭력적인 메시지, 화상, 음성 기타 공공질서 미풍양속에 반하는 정보를 공개 또는 게시하는 행위
  (9) 회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
  (10) 회사의 직원이나 서비스의 관리자를 가장하거나 사칭하여 또는 타인의 명의를 도용하여 글을 게시하거나 메일을 발송하는 행위
  (11) 장물, 마약, 향정신성 약품 등 국내 반입 및 판매가 금지된 제품 또는 국내법상 온라인 판매가 금지된 제품의 판매나 홍보를 하는 행위
  (12) 음란물 및 성인물을 게시, 홍보, 판매하는 행위
  (13) 유흥업, 퇴폐향락업 등 불법업태와 관련한 사항을 게시, 홍보하는 행위
  (14) 정치적, 사회적으로 물의를 일으킬 수 있는 행위
  (15) 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램 자료를 등록 또는 유포하는 행위
  (16) 회사가 제공하는 소프트웨어 등을 개작하거나 가공행위를 통하여 서비스를 복제, 분해 또는 모방 기타 변형하는 행위
  (17) 자동 접속 프로그램 등을 사용하는 등 정상적인 용법과 다른 방법으로 서비스를 이용하여 회사의 서버에 부하를 일으켜 회사의 정상적인 서비스를 방해하는 행위
  (18) 다른 회원의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
  (19) 기타 불법적이거나 회사에서 정한 규정을 위반하는 행위
④ 회사는 회원이 제①항의 행위를 하는 경우 해당 게시물 등을 삭제 또는 임시 삭제할 수 있으며 서비스의 이용을 제한하거나 일방적으로 본 계약을 해지할 수 있습니다.
⑤ 회원은 회원정보, 계정정보에 변경이 있는 경우 제10조에 따라 이를 즉시 변경하여야 하며, 더불어 비밀번호를 철저히 관리하여야 합니다. 회원의 귀책으로 말미암은 관리소홀, 부정사용 등에 의하여 발생하는 모든 결과에 대한 책임은 회원 본인이 부담하며, 회사는 이에 대한 어떠한 책임도 부담하지 않습니다.
⑥ 회원은 회사에서 공식적으로 인정한 경우를 제외하고는 서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없으며, 특히 해킹, 광고를 통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법배포 등을 할 수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등에 관해서는 회사가 책임을 지지 않으며, 회원은 이와 같은 행위와 관련하여 회사에 대하여 손해배상 의무를 집니다.
⑦ 회원은 직접 본인의 정보로 본인인증을 하여야 하고 이를 타인으로 하여금 하게 하거나 인증번호 등의 정보를 노출하여서는 안됩니다.
⑧ 회원은 회사의 사전 허락 없이 회사가 정한 이용 목적과 방법에 반하여 영업/광고활동 등을 할 수 없고, 회원의 서비스 이용이 회사의 재산권, 영업권 또는 비즈니스 모델을 침해하여서는 안됩니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 21조 (회원에 대한 통지)</TitleText>
          <Contents>
            {`① 회사가 회원에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한 회원이 기재한 E-mail로 할 수 있습니다.
② 회사는 불특정 다수 회원에 대한 통지의 경우 서비스 게시판 등에 게시함으로써 개별 통지에 갈음할 수 있습니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 22조 (서비스 이용 해지)</TitleText>
          <Contents>
            {`① 회원이 이용계약을 해지하고자 하는 때에는 사이트 또는 앱을 통해 안내된 해지방법에 따라 해지를 신청할 수 있습니다.
② 회사는 등록 해지신청이 접수되면 회원이 원하는 시점에 해당 회원의 서비스 이용을 해지하여야 합니다.
③ 회원이 계약을 해지할 경우, 관련법 및 개인정보처리방침에 따라 회사가 회원정보를 보유할 수 있는 경우를 제외하고 회원의 개인정보는 해지 즉시 삭제됩니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 23조 (서비스 이용 제한)</TitleText>
          <Contents>
            {`① 회사는 이용제한정책에서 정하는 바에 따라 회원이 본 약관상 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시적 이용정지, 영구적 이용정지 등의 단계로 서비스 이용을 제한하거나 이용계약을 해지할 수 있습니다. 단, 회원에게 제6조 제1항의 사유가 있음이 확인되거나 회원이 서비스 이용과 관련하여 불법행위를 하거나 조장, 방조한 경우에는 즉시 영구적 이용정지 조치 또는 이용계약 해지를 할 수 있습니다.
② 회사는 회원이 계속해서 1년 이상 서비스를 이용하지 않은 경우에는, 정보통신망법에 따라 필요한 조치를 취할 수 있고, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
③ 본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 회사는 제21조에 따라 회원에게 통지합니다.
④ 회원은 본조에 따른 서비스 이용정지 기타 서비스 이용과 관련된 이용제한에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있으며, 회사는 회원의 이의신청이 정당하다고 판단되는 경우 즉시 서비스 이용을 재개합니다.`}
          </Contents>
          <TitleText style={{ color: colors.primary_outline, marginTop: 16 }}>제5장 기타</TitleText>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 24조 (손해배상)</TitleText>
          <Contents>
            {`① 회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 본 약관을 위반한 회원은 회사에 발생하는 모든 손해를 배상하여야 합니다.
② 회원이 서비스를 이용하는 과정에서 행한 불법행위나 본 약관 위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 회사를 면책 시켜야 하며, 회사가 면책되지 못한 경우 당해 회원은 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다.`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 25조 (면책사항)</TitleText>
          <Contents>
            {`① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면책됩니다.
② 회사는 회원의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을 지지 않습니다.
③ 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그 밖에 서비스를 통하여 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다. 회사는 회원이 게재한 게시물의 정확성 등 내용에 대하여는 책임을 지지 않습니다.
④ 회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다. 회사는 회원이 작성한 회원 정보 및 인증 등 각종 회원 정보의 진실성에 대해 보증하지 아니하며 책임을 지지 않고, 이로 인해 발생한 정신적, 물질적 손해 등의 피해에 대한 책임을 지지 않습니다. 또한 회원이 다른 회원에게 경제적, 정신적, 물질적 피해를 가해도 그 책임은 가해자인 회원에게 있습니다. 단, 회사는 이에 대한 수사기관의 수사, 재판, 분쟁 등이 발생한 경우 수사기관 및 법원 등의 요청에 최대한 협조합니다.
⑤ 회원이 공개를 허락한 자료에 대해 발생되는 모든 문제에 대해서는 회사의 책임이 면제 됩니다. 또한 회원 및 상대 회원의 고의 또는 과실로 인해 회원의 프로필이 무단 저장되거나 무단 유출되는 것에 대해서 회사는 어떠한 책임도 부담하지 않습니다.
⑥ 게시물은 게시자의 책임 하에 관리, 운영되고, 회사는 서비스 운영 상의 문제를 제외한 책임은 게시자에게 귀속되며 회사는 어떠한 책임도 부담하지 않습니다.
⑦ 회사는 제3자가 서비스 내 화면 또는 링크된 웹사이트를 통하여 광고한 제품 또는 서비스의 내용과 품질에 대하여 감시할 의무가 없으며 그로 인한 어떠한 책임도 지지 아니합니다.
⑧ 회사는 회사 및 회사의 임직원 그리고 회사 대리인의 고의 또는 중대한 과실이 없는 한 다음 각 호의 사항으로부터 발생하는 손해에 대해 책임을 지지 아니합니다.
  (1) 회원정보 등의 허위 또는 부정확성에 기인하는 손해
  (2) 서비스에 대한 접속 및 서비스의 이용과정에서 발생하는 개인적인 손해
  (3) 서버에 대한 제3자의 모든 불법적인 접속 또는 서버의 불법적인 이용으로부터 발생하는 손해
  (4) 서버에 대한 전송 또는 서버로부터의 전송에 대한 제3자의 모든 불법적인 방해 또는 중단행위로부터 발생하는 손해
  (5) 제3자가 서비스를 이용하여 불법적으로 전송, 유포하거나 또는 전송, 유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로 인한 손해
  (6) 전송된 데이터의 오류 및 생략, 누락, 파괴 등으로 발생되는 손해
  (7) 회원간의 회원 상태정보 등록 및 서비스 이용 과정에서 발생하는 명예훼손 기타 불법행위로 인한 각종 민, 형사상 책임`}
          </Contents>
          <TitleText style={{ color: colors.grey_700, marginVertical: 4 }}>제 26조 (분쟁 조정 및 관할법원)</TitleText>
          <Contents>
            {`본 약관과 회사와 회원 간에 발생한 분쟁 등에 관하여는 대한민국 법령이 적용되며, 회사의 주소지를 관할하는 법원을 관할법원으로 합니다.`}
          </Contents>
          <Contents style={{ marginTop: 16 }}>
            {`부칙
본 약관은 2023년 11월 26일부터 시행됩니다.`}
          </Contents>
        </Container>
      </ScrollView>
    </ScreenLayout>
  )
}
const Container = styled.View`
  padding: 16px;
  /* gap: 4px; */
`
const Box = styled.View``
const TitleText = styled.Text`
  font-family: 'Spoqa-Bold';
  font-size: 12px;
  margin-top: 8px;
  font-style: normal;
  line-height: 15px;
`
const Contents = styled.Text`
  font-family: 'Spoqa-Regular';
  color: ${colors.grey_700};
  font-size: 12px;
  font-style: normal;
  line-height: 15px;
`
